Autodesk.Revit.DB.ColorWithTransparency.SetTransparency(System.UInt32)
set transparency
transparency:
transparency
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The value is not valid. The valid range is 0 to 255.
Since:
2017

Autodesk.Revit.DB.ColorWithTransparency.GetTransparency
get transparency
Returns:
transparency
Since:
2017

Autodesk.Revit.DB.ColorWithTransparency.SetBlue(System.UInt32)
set blue
blue:
blue
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The value is not valid. The valid range is 0 to 255.
Since:
2017

Autodesk.Revit.DB.ColorWithTransparency.GetBlue
get blue
Returns:
blue
Since:
2017

Autodesk.Revit.DB.ColorWithTransparency.SetGreen(System.UInt32)
set green
green:
green
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The value is not valid. The valid range is 0 to 255.
Since:
2017

Autodesk.Revit.DB.ColorWithTransparency.GetGreen
get green
Returns:
green
Since:
2017

Autodesk.Revit.DB.ColorWithTransparency.SetRed(System.UInt32)
set red
red:
red
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The value is not valid. The valid range is 0 to 255.
Since:
2017

Autodesk.Revit.DB.ColorWithTransparency.GetRed
get red
Returns:
red
Since:
2017

Autodesk.Revit.DB.ColorWithTransparency.SetColor(Autodesk.Revit.DB.Color)
set color
color:
color
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.ColorWithTransparency.GetColor
get color
Returns:
color
Since:
2017

Autodesk.Revit.DB.ColorWithTransparency.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ColorWithTransparency.#ctor(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
color
red:
red
green:
green
blue:
blue
transparency:
transparency
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The value is not valid. The valid range is 0 to 255.
Since:
2017

Autodesk.Revit.DB.ColorWithTransparency.#ctor
color
Since:
2017

Autodesk.Revit.DB.ColorWithTransparency
Color with transparency
Since:
2017